In [1]:
%load_ext sql

In [2]:
%sql sqlite:///sample2.db

u'Connected: @sample2.db'

In [3]:
%sql select * from student;

 * sqlite:///sample2.db
Done.

[(100, u'JONES', u'HISTORY', u'GR', 21),
 (150, u'PARKS', u'ACCOUNTING', u'SO', 19),
 (200, u'BAKER', u'MATH', u'GR', 50),
 (250, u'GLASS', u'HISTORY', u'SN', 50),
 (300, u'BAKER', u'ACCOUNTING', u'SN', 41),
 (350, u'RUSSEL', u'MATH', u'JR', 20),
 (400, u'RYE', u'ACCOUNTING', u'FR', 18),
 (450, u'JONES', u'HISTORY', u'SN', 24)]

In [4]:
%sql select count(*) from student;

 * sqlite:///sample2.db
Done.

[(8,)]

In [5]:
res = %sql select * from class;

 * sqlite:///sample2.db
Done.

In [6]:
print res

+-------+-------+-------+
| cname |  time |  room |
+-------+-------+-------+
| BA200 |  M-F9 | SC110 |
| BD445 |  MWF3 | SC213 |
| BF410 |  MWF8 | SC213 |
| CS150 |  MWF3 | EA304 |
| CS250 | MWF12 | EB210 |
+-------+-------+-------+

In [15]:
name = 'B%'
%sql select * from student where sname like :name;

 * sqlite:///sample2.db
Done.

[(200, u'BAKER', u'MATH', u'GR', 50),
 (300, u'BAKER', u'ACCOUNTING', u'SN', 41)]